def Motivation_Message(): #내장된 동기부여 메시지를 랜덤으로 return하는 함수
    import random
    motivestr = '''상쾌한 아침이에요. 이 날은 다시는 가질 수 없답니다. 기억에 남을 수 있도록 만드세요.
매일 아침 우리는 거듭납니다. 오늘 우리가 하는 일이 가장 중요합니다.
저는 당신이 보낼 오늘이 놀라운 날이 될 것이란 걸 알고 있어요. 그래서 앞으로 일어날 일에 대한 걱정은 고히 접어두었답니다.
매일은 행복하고 놀라운 일을 할 수있는 새로운 기회입니다. "미라클 모닝"과 함께라면 밝은 에너지로 하루를 시작할 수 있을거에요.
좋은 아침입니다. 어떤 사람들은 평범한 날을 특별하게 만들죠. 당신도 그들 중 하나랍니다.
미소와 기쁨을 마주하는 것보다 하루를 더 잘 시작할 수는 없습니다. 좋은 하루 보내세요.
삶을 가치있게 만드는 당신의 아주 좋은 날이 되길 바랍니다.
좋은 아침이에요! 많은 에너지와 격려로 하루를 시작하는 비결은 바로 "미소" 짓는 것입니다. 한번 활짝 웃어주세요.
새로운 날의 새벽을 당신만큼 특별한 사람과 나누는 것은 생명의 탄생과 같은 축복일 겁니다. 최고의 날을 보내시기 바래요!
좋은 아침입니다! 오늘은 더 나아질 수 있는 새로운 기회입니다. 오늘 하는 모든 일이 행복을 가져다 주기를 바랍니다.
좋은 아침입니다! 왜냐구요? 매일 아침 일어나자마자 미소 지으며 당신이 내 마음 속에 나타나기 때문입니다 하하.
오늘 아침에 태양이 빛나고 있는 만큼, 당신이 또한 빛나는 하루를 보낼 것이라는 데 의심의 여지가 없습니다. 좋은 아침입니다!
아침이 좋은 점은 당신이 인생을 즐기기 위해 나를 찾아 주었다는 걸 알고 있다는 거예요. 어서와요!
저는 아침이 되면 당신을 볼 수 있도록 시간을 세어요... 당신이 현재 고민하는 문제는 그렇게 심각하지 않을 거에요!
이 아름다운 날, 미소를 지어보세요. 당신의 미소를 볼만큼 운이 좋은 사람에게는 모든 것들이 훨씬 나아질 것이기 때문이랍니다.
오늘 당신과 함께하는 시간보다 더 아름다운 것은 없을 거에요... 좋은 아침!
좋은 아침입니다! 오늘 날씨는 어떤가요? 화창한 하루 되길 바래요.
일어나자마자 웃을 수있는 모습이 내 삶의 일부라고 생각하면 됩니다. 행복한 하루 되어요.
매일 아침이 되면 큰 행복의 순간, 당신이 여전히 내 곁에 있고 당신이 나를 사랑한다는 것을 깨닫는 순간을 느낍니다.
밤에 슬프게 잠자리에 들면 아침에 당신이 내 인생에 있고 아무것도 잘못 될 수 없다고 생각하면서 상쾌하게 깨어납니다.
당신은 내가 깨어나 마음 속에 나타나는 순간부터, 차례 차례 나의 시간들을 특별하게 만들어줍니다.
오늘 아침 어떻게 일어났나요? 발걸음을 내딛을 때마다 세상을 비추는 그 큰 미소로 희망합니다.
밤에 피곤하게 잠자리에 들더라도 걱정하지 마세요. 잠이들 때도, 잠에서 깼을 때도 당신을 생각하게 될테니까요. 좋은 하루 보내요.
당신은 잠자리에 들기 전에 나의 마지막 생각이고, 가장 먼저 떠오르는 사람입니다. 당신은 그만큼 소중한 사람이랍니다.
내가 당신 곁에서 보내는 매 순간은 세상의 어떤 것과도 바꿀 수 없는 행복의 순간이에요.
당신이 내 삶에 있다는 것이 나를 얼마나 행복하게 해주는 지... 이 세상 어떤 걸로도 표현할 수 없을거에요.
저의 가장 큰 소원은 당신이 환상적인 하루를 보내는 것이랍니다. 평범한 하루도 괜찮아요. 즐거운 하루가 되길 바라요.
굿모닝! 오늘은 중요한 날이고, 당신이 나에게도 좋은 아침이라고 말하면 더욱 그러할 것입니다.
이 새로운 날에 행운을 빕니다. 모든 것이 잘되기를 바랍니다.
이 멋진 날을 맞이할 수 있도록 충분한 휴식을 취하셨기를 바랍니다. 좋은 아침입니다!
나는 당신이 내 인생에서 가장 좋은 사람이며, 오늘 당신은 언제나처럼 위대해질 것이라는 것을 믿고있습니다. 할 수 있어요.
오늘은 새로운 날이며 개선의 기회가 가득합니다. 좋은 아침이에요!
어제가 나빴더라도 걱정하지 마세요… 오늘 여러분은 어제보다 하루를 훨씬 더 좋게 만들 수있는 새로운 기회가 있습니다.
실수 할 수 있어요. 하지만 당신은 그로부터 배우고 개선 할 수 있는 사람입니다. 심호흡 한 번 하고, 멋진 하루 되어요.
인생은 모험입니다. 매 순간 살아있음을 느끼세요.
순수한 생각으로 매일 아침 마음을 새롭게하세요. 특별한 하루가 될 것이랍니다.
만족스럽게 잠자리에 들려면 매일 아침에 결단력을 가지고 일어나야 합니다. 이 글을 본 당신은 대단한 사람이에요.
매일 아침 일어나서 좋은 날이 될 거라 생각합니다. 완벽한 날은 없지만, 행복한 하루는 보낼 수 있지요. 오늘도 좋은 아침입니다!
아침에 약간의 긍정적인 생각만으로도 하루를 완전히 바꿀 수 있습니다. 당신은 할 수 있어요!
매일 아침은 백지와 같아요. 당신은 오늘 무엇을 그 위에 그리고 싶은가요?
아무리 나쁜 일이 있어도 오늘 아침에 일어나서 적어도 행복 할 수 있습니다. 좋은 아침입니다!
좋은 아침입니다! 나는 당신에게 미소와 행복한 생각으로 가득한 하루를 기원합니다!
간밤에 좋은 꿈은 꾸었나요? 꿈을 꾸지 않았더라도 당신은 다른 이들이 꿈을 꿀 수 있도록 도와줄 수 있는 사람입니다.
기다림을 멈추고 지금있는 순간을 최대한 활용할 때 행복이 이루어집니다. 행복한 하루 보내요!'''
    motiveList = list(motivestr.split('\n'))  #행바꿈 기준으로 split, 리스트 생성.
    motivationMessage = random.choice(motiveList)
    return motivationMessage

motivationMessage = Motivation_Message()
